Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter.StringValue Property
 The string value of the profile item parameter.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string StringValue { get; set; }
Public Property StringValue As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace